[
    {
        "Type": "Stock",
        "Ticker Symbol": "AAPL",
        "Company Name": "Apple Inc.",
        "Details": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.",
        "Summary": "Apple designs and manufactures consumer electronics like iPhones, Macs, and iPads, along with wearables like Apple Watch. It offers services including Apple Music, iCloud, and Apple Pay, supported by its proprietary software ecosystem. The company operates retail stores worldwide and sells through third-party distributors.",
        "Sector": "Technology",
        "Industry": "Consumer Electronics",
        "Current Price": 254.49,
        "Beta Value": 1.26,
        "Market Capitalization": 3846819807232,
        "P/E Ratio": 29.95
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "NVDA",
        "Company Name": "NVIDIA Corporation",
        "Details": "NVIDIA Corporation provides graphics and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro\/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications. The Compute & Networking segment comprises Data Center computing platforms and end-to-end networking platforms, including Quantum for InfiniBand and Spectrum for Ethernet; NVIDIA DRIVE automated-driving platform and automotive development agreements; Jetson robotics and other embedded platforms; NVIDIA AI Enterprise and other software; and DGX Cloud software and services. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.",
        "Summary": "NVIDIA specializes in GPUs for gaming, AI, and data centers, along with networking and autonomous driving solutions. Its products power high-performance computing, graphics rendering, and machine learning applications. The company serves industries ranging from healthcare to automotive with its advanced semiconductor technologies.",
        "Sector": "Technology",
        "Industry": "Semiconductors",
        "Current Price": 134.7,
        "Beta Value": 1.96,
        "Market Capitalization": 3298803056640,
        "P/E Ratio": 32.08
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "MSFT",
        "Company Name": "Microsoft Corporation",
        "Details": "Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.",
        "Summary": "Microsoft develops software like Windows and Office, cloud services via Azure, and hardware including Surface devices. It provides enterprise solutions for productivity, AI, and cybersecurity across industries. The company also offers gaming through Xbox and professional networking via LinkedIn.",
        "Sector": "Technology",
        "Industry": "Software - Infrastructure",
        "Current Price": 436.6,
        "Beta Value": 0.91,
        "Market Capitalization": 3246068596736,
        "P/E Ratio": 31.25
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "AMZN",
        "Company Name": "Amazon.com, Inc.",
        "Details": "Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.",
        "Summary": "Amazon dominates e-commerce with its online marketplace, offering everything from retail goods to digital content. Its Amazon Web Services (AWS) is a leader in cloud computing, serving businesses globally. The company also produces consumer electronics like Echo devices and operates logistics networks.",
        "Sector": "Consumer Cyclical",
        "Industry": "Internet Retail",
        "Current Price": 224.92,
        "Beta Value": 1.39,
        "Market Capitalization": 2365033807872,
        "P/E Ratio": 30.98
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "GOOG",
        "Company Name": "Alphabet Inc.",
        "Details": "Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.",
        "Summary": "Google provides search, advertising, and cloud services, along with hardware like Pixel phones and Nest devices. Its Android OS powers most smartphones, while YouTube is a leading video platform. The company invests heavily in AI, autonomous tech, and digital infrastructure.",
        "Sector": "Communication Services",
        "Industry": "Internet Content & Information",
        "Current Price": 192.96,
        "Beta Value": 1.03,
        "Market Capitalization": 2351623045120,
        "P/E Ratio": 18.11
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "META",
        "Company Name": "Meta Platforms, Inc.",
        "Details": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California",
        "Summary": "Meta Platforms develops social media apps like Facebook, Instagram, and WhatsApp, connecting billions globally. It focuses on virtual reality through its Meta Quest headsets and the metaverse vision. The company monetizes through digital advertising and consumer hardware sales.",
        "Sector": "Communication Services",
        "Industry": "Internet Content & Information",
        "Current Price": 585.25,
        "Beta Value": 1.28,
        "Market Capitalization": 1477457739776,
        "P/E Ratio": 27.94
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "TSLA",
        "Company Name": "Tesla, Inc.",
        "Details": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.",
        "Summary": "Tesla designs electric vehicles (Model 3, Cybertruck) and renewable energy solutions like solar panels. Its Autopilot and Full Self-Driving tech pioneer autonomous driving. The company operates Gigafactories worldwide to scale production.",
        "Sector": "Consumer Cyclical",
        "Industry": "Auto Manufacturers",
        "Current Price": 421.06,
        "Beta Value": 2.58,
        "Market Capitalization": 1351627833344,
        "P/E Ratio": 117.37
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "AVGO",
        "Company Name": "Broadcom Inc.",
        "Details": "Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.",
        "Summary": "Broadcom supplies semiconductors for data centers, networking, and wireless communications. Its products enable 5G, cloud computing, and enterprise infrastructure. The company also provides software for mainframe and cybersecurity solutions.",
        "Sector": "Technology",
        "Industry": "Semiconductors",
        "Current Price": 220.79,
        "Beta Value": 1.07,
        "Market Capitalization": 1031217348608,
        "P/E Ratio": 67.41
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "BRK-B",
        "Company Name": "Berkshire Hathaway Inc.",
        "Details": "Berkshire Hathaway Inc., through its subsidiaries, engages in the insurance, freight rail transportation, and utility businesses worldwide. The company provides property, casualty, life, accident, and health insurance and reinsurance; and operates railroad systems in North America. It also generates, transmits, stores, and distributes electricity from natural gas, coal, wind, solar, hydroelectric, nuclear, and geothermal sources; operates natural gas distribution and storage facilities, interstate pipelines, liquefied natural gas facilities, and compressor and meter stations; and holds interest in coal mining assets. In addition, the company manufactures boxed chocolates and other confectionery products; specialty chemicals, metal cutting tools, and components for aerospace and power generation applications; flooring products; insulation, roofing, and engineered products; building and engineered components; paints and coatings; and bricks and masonry products, as well as offers manufactured and site-built home construction, and related lending and financial services. Further, it provides recreational vehicles, apparel and footwear products, jewelry, and custom picture framing products, as well as alkaline batteries; castings, forgings, fasteners\/fastener systems, aerostructures, and precision components; and cobalt, nickel, and titanium alloys. Additionally, the company distributes televisions and information; franchises and services quick service restaurants; distributes electronic components; and offers logistics services, grocery and foodservice distribution services, and professional aviation training and shared aircraft ownership programs. It also retails automobiles; furniture, bedding, and accessories; household appliances, electronics, and computers; jewelry, watches, crystal, china, stemware, flatware, gifts, and collectibles; kitchenware; and motorcycle clothing and equipment. The company was incorporated in 1998 and is headquartered in Omaha, Nebraska.",
        "Summary": "Berkshire Hathaway owns diverse businesses, including GEICO insurance, BNSF Railway, and energy utilities. It invests in major companies like Apple and Coca-Cola. Led by Warren Buffett, it focuses on long-term value and acquisitions.",
        "Sector": "Financial Services",
        "Industry": "Insurance - Diversified",
        "Current Price": 453.2,
        "Beta Value": 0.8,
        "Market Capitalization": 978776031232,
        "P/E Ratio": 11.96
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "WMT",
        "Company Name": "Walmart Inc.",
        "Details": "Walmart Inc. engages in the operation of retail, wholesale, other units, and eCommerce worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, hypermarkets, warehouse clubs, cash and carry stores, and discount stores under Walmart and Walmart Neighborhood Market brands; membership-only warehouse clubs; ecommerce websites, such as walmart.com.mx, walmart.ca, flipkart.com, PhonePe and other sites; and mobile commerce applications. The company offers grocery and consumables, including dairy, meat, bakery, deli, produce, dry, chilled or frozen packaged foods, alcoholic and nonalcoholic beverages, floral, snack foods, candy, other grocery items, health and beauty aids, paper goods, laundry and home care, baby care, pet supplies, and other consumable items; fuel, tobacco and other categories. It is also involved in the provision of health and wellness products covering pharmacy, optical and hearing services, and over-the-counter drugs and other medical products; and home and apparel including home improvement, outdoor living, gardening, furniture, apparel, jewelry, tools and power equipment, housewares, toys, seasonal items, mattresses and tire and battery centers. In addition, the company offers consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. Further, it operates digital payment platforms; and offers financial services and related products, including money transfers, bill payments, money orders, check cashing, prepaid access, co-branded credit cards, installment lending, and earned wage access. Additionally, the company markets lines of merchandise under private brands, including Allswell, Athletic Works, Equate, and Free Assembly. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. Walmart Inc. was founded in 1945 and is based in Bentonville, Arkansas.",
        "Summary": "Walmart operates hypermarkets, discount stores, and e-commerce platforms globally. It offers groceries, apparel, electronics, and financial services. The company emphasizes low prices and supply chain efficiency.",
        "Sector": "Consumer Defensive",
        "Industry": "Discount Stores",
        "Current Price": 92.24,
        "Beta Value": 0.69,
        "Market Capitalization": 740999888896,
        "P/E Ratio": 34.52
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "LLY",
        "Company Name": "Eli Lilly and Company",
        "Details": "Eli Lilly and Company discovers, develops, and markets human pharmaceuticals worldwide. The company offers Basaglar, Humalog, Humalog Mix 75\/25, Humalog U-100, Humalog U-200, Humalog Mix 50\/50, insulin lispro, insulin lispro protamine, insulin lispro mix 75\/25, Humulin, Humulin 70\/30, Humulin N, Humulin R, and Humulin U-500 for diabetes; Jardiance, Mounjaro, and Trulicity for type 2 diabetes; and Zepbound for obesity. It provides oncology products, including Alimta, Cyramza, Erbitux, Jaypirca, Retevmo, Tyvyt, and Verzenio. In addition, the company offers Olumiant for rheumatoid arthritis, atopic dermatitis, severe alopecia areata, and COVID-19; Taltz for plaque psoriasis, psoriatic arthritis, ankylosing spondylitis, and non-radiographic axial spondylarthritis; Omvoh for ulcerative colitis; Cymbalta for depressive disorder, diabetic peripheral neuropathic pain, generalized anxiety disorder, fibromyalgia, and chronic musculoskeletal pain; Ebglyss for severe atopic dermatitis; and Emgality for migraine prevention and episodic cluster headache. Further, it provides Cialis for erectile dysfunction and benign prostatic hyperplasia; and Forteo for osteoporosis. It operates Lilly Seaport Innovation Center (LSC), a research and development facility in the Boston Seaport to advancing Lilly's efforts in RNA and DNA-based therapies as well as discovering new drug targets to create life-changing medicines across several disease states, including diabetes, obesity, cardiovascular diseases, neurodegeneration, and chronic pain. It has collaborations with Incyte Corporation; Boehringer Ingelheim Pharmaceuticals, Inc.; F. Hoffmann-La Roche Ltd and Genentech, Inc.; Biologics, Inc., AbCellera Biologics Inc.; Verge Genomics; and Chugai Pharmaceutical Co., Ltd, as well as development collaboration with Eli Lilly and Company for developing QIAstat-Dx IVD panel, for the detection of various APOE genotypes. The company was founded in 1876 and is headquartered in Indianapolis, Indiana.",
        "Summary": "Eli Lilly develops pharmaceuticals for diabetes (Trulicity), oncology, and immunology. It researches neurodegenerative diseases and obesity treatments. The company partners globally to expand access to medicines.",
        "Sector": "Healthcare",
        "Industry": "Drug Manufacturers - General",
        "Current Price": 767.76,
        "Beta Value": 0.5,
        "Market Capitalization": 690458853376,
        "P/E Ratio": 62.88
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "JPM",
        "Company Name": "JPMorgan Chase & Co.",
        "Details": "JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.",
        "Summary": "JPMorgan Chase provides banking, asset management, and investment services worldwide. It serves corporations, governments, and individuals with tailored financial solutions. The firm is a leader in mergers and capital markets.",
        "Sector": "Financial Services",
        "Industry": "Banks - Diversified",
        "Current Price": 237.6,
        "Beta Value": 1,
        "Market Capitalization": 668924837888,
        "P/E Ratio": 10.65
    },
    {
        "Type": "Stock",
        "Ticker Symbol": "V",
        "Company Name": "Visa Inc.",
        "Details": "Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, bank accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource and Authorize.net that provides new and enhanced payment integrations with ecommerce platforms, enabling sellers and acquirers to offer tailored commerce experiences; risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Consumer Authentication Service, Visa Protect Authentication Intelligence, and Visa Provisioning Intelligence; and Visa Consulting and Analytics, a payment consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brands. The company serves merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.",
        "Summary": "Visa operates a global payments network for credit\/debit transactions. Its technology enables secure digital and in-person commerce. The company partners with banks, merchants, and fintech innovators.",
        "Sector": "Financial Services",
        "Industry": "Credit Services",
        "Current Price": 317.71,
        "Beta Value": 0.94,
        "Market Capitalization": 615235846144,
        "P/E Ratio": 31.53
    }
]